### Python/Pandas: Identify Duplicates across Columns
Source: https://stackoverflow.com/questions/51182988/python-pandas-identify-duplicates-across-columns

In [1]:
import pandas as pd
import numpy as np
data={'Col1':['AAPL', np.nan, 'GOOG', 'MMM', np.nan, 'INTC', 'FB'],'Col2':['GOOG', 'IBM', 'MSFT', np.nan, 'GOOG', 'AAPL', 'VZ']}
df=pd.DataFrame(data,columns=['Col1','Col2'])
df

   Col1  Col2
0  AAPL  GOOG
1   NaN   IBM
2  GOOG  MSFT
3   MMM   NaN
4   NaN  GOOG
5  INTC  AAPL
6    FB    VZ

In [2]:
df['Col3'] = False
df['Col4'] = False
df['Col5'] = False

df

   Col1  Col2   Col3   Col4   Col5
0  AAPL  GOOG  False  False  False
1   NaN   IBM  False  False  False
2  GOOG  MSFT  False  False  False
3   MMM   NaN  False  False  False
4   NaN  GOOG  False  False  False
5  INTC  AAPL  False  False  False
6    FB    VZ  False  False  False

In [3]:
df['Col3'] = False
df['Col4'] = False
df['Col5'] = False

for i,row in df.iterrows():
  if df.loc[i,'Col1'] in (df.Col2.values):
      df.loc[i,'Col3'] = True
      
for i,row in df.iterrows():
  if df.loc[i,'Col2'] in (df.Col1.values):
      df.loc[i,'Col4'] = True
      
for i,row in df.iterrows():
  if df.loc[i,'Col3']| df.loc[i,'Col4'] == True:
      df.loc[i,'Col5'] = True

In [4]:
df

   Col1  Col2   Col3   Col4   Col5
0  AAPL  GOOG   True   True   True
1   NaN   IBM  False  False  False
2  GOOG  MSFT   True  False   True
3   MMM   NaN  False  False  False
4   NaN  GOOG  False   True   True
5  INTC  AAPL  False   True   True
6    FB    VZ  False  False  False